#-*-coding:utf-8 -*-

'''
    @Project ：SEMG_Assistant
    @File    ：main.py
    @description：
        主程序，工作流程如下：
        （1） 选择端口，配置端口相关参数，在完成通信同步后，读取STM32发送的电压数据（f约为300Hz左右），放入暂存数组中
        （2）
        （3）
        （4）
        （5）
        （6）
        （7）
    @Author  ：leeqingshui
    @Date    ：2023/1/13 4:56
'''

# =============================================== 导入库 ===============================================

# 串口通信相关依赖库
from SerialCommunication import Serial_Data_Receive,Rect_Now_Val_Values
# 绘图相关依赖库



# ============================================== 全局变量 ==============================================





# ============================================== 函数定义 ==============================================



















